index=main source="WinEventLog:Microsoft-Windows-Sysmon/Operational"
EventCode=3
Image="*\\powershell.exe"
NOT (DestinationIp="127.0.0.1" OR DestinationIp="::1")
NOT (DestinationIp="10.*" OR DestinationIp="192.168.*" OR DestinationIp="172.16.*")
| table _time, host, User, Image, DestinationIp, DestinationHostname, DestinationPort
| sort -_time
